namespace _3Task
{
    /*Використовуючи Visual Studio, створіть проект за шаблоном Console Application. 
     * Потрібно: Створити клас Vehicle. У тілі класу створіть поля: координати та параметри суден (ціна, швидкість, рік випуску). 
     * Створіть 3 похідні класи Plane, Саг і Ship. Для класу Plane має бути визначена висота та кількість пасажирів. 
     * Для класу Ship – кількість пасажирів та порт приписки. Написати програму, яка виводить на екран інформацію про кожен 
     * засіб пересування. */
    internal class Program
    {
        static void Main(string[] args)
        {
            //описуємо наші транспортні засоби
            Plane plane = new Plane(136, 286, 1000000m, 500, 2025, 1000, 255);
            Car car = new Car(120, 56, 15000m, 250, 2022);
            Ship ship = new Ship(635, 488, 500000m, 130, 2010, 50, "Sea port Odessa");

            plane.ShowInfo();
            car.ShowInfo();
            ship.ShowInfo();
        }
    }
}
